Model-Based collaborative filtering (CF) by using singular value decomposition (SVD) and Memory-Based CF by computing cosine similarity.

Using MovieLens data

In [1]:
import numpy as np
import pandas as pd

In [4]:
column_names=['user_id', 'item_id', 'rating', 'timestamp']
df=pd.read_csv('u.data', sep='\t', names=column_names)
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [7]:
movie_name=pd.read_csv('Movie_Id_Titles')
movie_name.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [10]:
df=pd.merge(df, movie_name, on="item_id")
df.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [13]:
print('Number of unique IDs',df['user_id'].nunique())
print('Number of unique movies',df['item_id'].nunique())

Number of unique IDs 944
Number of unique movies 1682

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
train_data, test_data = train_test_split(df, test_size=0.25)